---
kind: method
id: M:Autodesk.Revit.DB.View.HasDisplayStyle
zh: 视图
source: html/42878b21-9d90-7440-a916-9ab577247f2e.htm
---
# Autodesk.Revit.DB.View.HasDisplayStyle Method

**中文**: 视图

Indicates if view has a DisplayStyle property

## Syntax (C#)
```csharp
public bool HasDisplayStyle()
```

## Returns
True if view has a DisplayStyle property